Getting this during testing in schematics -
```
2025/04/15 10:11:37 Terraform plan | Terraform used the selected providers to generate the following execution
         2025/04/15 10:11:37 Terraform plan | plan. Resource actions are indicated with the following symbols:
         2025/04/15 10:11:37 Terraform plan |   ~ update in-place
         2025/04/15 10:11:37 Terraform plan | +/- create replacement and then destroy
         2025/04/15 10:11:37 Terraform plan | 
         2025/04/15 10:11:37 Terraform plan | Terraform will perform the following actions:
         2025/04/15 10:11:37 Terraform plan | 
         2025/04/15 10:11:37 Terraform plan |   # module.key_protect.module.key_protect[0].ibm_kms_instance_policies.key_protect_instance_policies will be updated in-place
         2025/04/15 10:11:37 Terraform plan |   ~ resource "ibm_kms_instance_policies" "key_protect_instance_policies" {
         2025/04/15 10:11:37 Terraform plan |       ~ endpoint_type = "private" -> "public"
         2025/04/15 10:11:37 Terraform plan |         id            = "crn:v1:bluemix:public:kms:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:2df075a8-72b2-4f29-9da8-ffd59fc33b05::"
         2025/04/15 10:11:37 Terraform plan |         # (1 unchanged attribute hidden)
         2025/04/15 10:11:37 Terraform plan | 
         2025/04/15 10:11:38 Terraform plan |         # (4 unchanged blocks hidden)
         2025/04/15 10:11:38 Terraform plan |     }
         2025/04/15 10:11:38 Terraform plan | 
         2025/04/15 10:11:38 Terraform plan |   # module.key_protect.module.kms_key_rings["icl-adv-w2mdfc-cloud-logs"].ibm_kms_key_rings.key_ring must be replaced
         2025/04/15 10:11:38 Terraform plan | +/- resource "ibm_kms_key_rings" "key_ring" {
         2025/04/15 10:11:38 Terraform plan |       ~ endpoint_type = "private" -> "public" # forces replacement
         2025/04/15 10:11:38 Terraform plan |       ~ id            = "icl-adv-w2mdfc-cloud-logs:keyRing:crn:v1:bluemix:public:kms:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:2df075a8-72b2-4f29-9da8-ffd59fc33b05::" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |         # (3 unchanged attributes hidden)
         2025/04/15 10:11:38 Terraform plan |     }
         2025/04/15 10:11:38 Terraform plan | 
         2025/04/15 10:11:38 Terraform plan |   # module.key_protect.module.kms_keys["icl-adv-w2mdfc-cloud-logs.icl-adv-w2mdfc-cloud-logs-key"].ibm_kms_key.key will be updated in-place
         2025/04/15 10:11:38 Terraform plan |   ~ resource "ibm_kms_key" "key" {
         2025/04/15 10:11:38 Terraform plan |       ~ endpoint_type           = "private" -> "public"
         2025/04/15 10:11:38 Terraform plan |         id                      = "crn:v1:bluemix:public:kms:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:2df075a8-72b2-4f29-9da8-ffd59fc33b05:key:bc710a24-c678-4b06-a29f-74f7bcdfba40"
         2025/04/15 10:11:38 Terraform plan |         # (19 unchanged attributes hidden)
         2025/04/15 10:11:38 Terraform plan |     }
         2025/04/15 10:11:38 Terraform plan | 
         2025/04/15 10:11:38 Terraform plan |   # module.key_protect.module.kms_keys["icl-adv-w2mdfc-cloud-logs.icl-adv-w2mdfc-cloud-logs-key"].ibm_kms_key_policies.root_key_policy[0] must be replaced
         2025/04/15 10:11:38 Terraform plan | +/- resource "ibm_kms_key_policies" "root_key_policy" {
         2025/04/15 10:11:38 Terraform plan |       ~ endpoint_type           = "private" -> "public" # forces replacement
         2025/04/15 10:11:38 Terraform plan |       ~ id                      = "crn:v1:bluemix:public:kms:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:2df075a8-72b2-4f29-9da8-ffd59fc33b05:key:bc710a24-c678-4b06-a29f-74f7bcdfba40" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |       ~ resource_controller_url = "https://cloud.ibm.com/services/kms/crn%!A(MISSING)v1%!A(MISSING)bluemix%!A(MISSING)public%!A(MISSING)kms%!A(MISSING)eu-gb%!A(MISSING)a%!F(MISSING)abac0df06b644a9cabc6e44f55b3880e%!A(MISSING)2df075a8-72b2-4f29-9da8-ffd59fc33b05%!A(MISSING)%!A(MISSING)" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |       ~ resource_crn            = "crn:v1:bluemix:public:kms:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:2df075a8-72b2-4f29-9da8-ffd59fc33b05:key:bc710a24-c678-4b06-a29f-74f7bcdfba40" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |       ~ resource_name           = "icl-adv-w2mdfc-cloud-logs-key" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |       ~ resource_status         = "1" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |         # (2 unchanged attributes hidden)
         2025/04/15 10:11:38 Terraform plan | 
         2025/04/15 10:11:38 Terraform plan |       ~ dual_auth_delete {
         2025/04/15 10:11:38 Terraform plan |           ~ created_by       = "IBMid-6680007ZHF" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |           ~ creation_date    = "2025-04-15 10:06:29 +0000 UTC" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |           ~ crn              = "crn:v1:bluemix:public:kms:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:2df075a8-72b2-4f29-9da8-ffd59fc33b05:policy:195142de-3ca2-4358-94fb-7568b8bea0b2" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |           ~ id               = "195142de-3ca2-4358-94fb-7568b8bea0b2" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |           ~ last_update_date = "2025-04-15 10:06:29 +0000 UTC" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |           ~ updated_by       = "IBMid-6680007ZHF" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |             # (1 unchanged attribute hidden)
         2025/04/15 10:11:38 Terraform plan |         }
         2025/04/15 10:11:38 Terraform plan | 
         2025/04/15 10:11:38 Terraform plan |       ~ rotation {
         2025/04/15 10:11:38 Terraform plan |           ~ created_by       = "IBMid-6680007ZHF" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |           ~ creation_date    = "2025-04-15 10:06:27 +0000 UTC" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |           ~ crn              = "crn:v1:bluemix:public:kms:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:2df075a8-72b2-4f29-9da8-ffd59fc33b05:policy:a1d08fd8-ff4f-48c4-820c-1a2687536ab0" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |           ~ id               = "a1d08fd8-ff4f-48c4-820c-1a2687536ab0" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |           ~ last_update_date = "2025-04-15 10:06:29 +0000 UTC" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |           ~ updated_by       = "IBMid-6680007ZHF" -> (known after apply)
         2025/04/15 10:11:38 Terraform plan |             # (2 unchanged attributes hidden)
         2025/04/15 10:11:38 Terraform plan |         }
         2025/04/15 10:11:38 Terraform plan |     }
         2025/04/15 10:11:38 Terraform plan | 
         2025/04/15 10:11:38 Terraform plan | Plan: 2 to add, 2 to change, 2 to destroy.
         2025/04/15 10:11:38 Command finished successfully.
```